# -*- coding: utf-8 -*-
"""
@Time ： 2020/10/16 20:17
@Auth ： Mr. William 1052949192
@Company ：特斯汀学院 @testingedu.com.cn
@Function ：算术运算
"""
################ 算术运算 ##################
# # 四舍五入/取整
# """
# 精度：计算机在算术运算的时候，小数是不能全部保存的，它只会保存双精度的位数
# 买一个水果：2元3个，假设买100W个
# """
# # 先算1个多少钱
# price = int((2/3) * 100) / 100
# print(price * 1000000)
#
# price = round(2/3,2)
# print(price * 1000000)
#
# # 运算符的优先级
# z = 2 + 2 ** 2 * 3 ** 3
# print(z)
# # 先算幂运算
# z = 2 + 4 * 27
# # 再算乘法
# z = 2 + 108
# # 最后算加法
# z = 110

################ 字符串算术运算 ##################
# 拼接
s1 = 'ab'
s2 = 'cd'
print(s1 + s2)

# 重复拼接
s1 = "ab"
print(s1 * 3)
