# -*- coding: utf-8 -*-
"""
@Time ： 2020/10/16 20:17
@Auth ： Mr. William 1052949192
@Company ：特斯汀学院 @testingedu.com.cn
@Function ：比较运算
"""
################ 数值的比较运算 ##################
# ==，!=，>，<，>=，<=
# 和java的区别：Python里面可以连写
# x = 1
# y = 2
# z = 2
# print(x < y < z)

################ 字符串的比较运算 #################
# ascii码的比较，按位比较
# 只要一位不一样就可以确定大小，后面的位数就不比了
s1 = "abc"
s2 = "abc"
print(s1 > s2)
# 两个字符串必须一模一样
print(s1 == s2)
print(s1 != s2)
# 包含：主字符串必须有一个连续的子串和子字符串一模一样，相等也包含
print(s1.__contains__(s2))



